{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 64, "word_counts": "{\"hi\": 1, \"hello\": 1, \"how\": 1, \"are\": 1, \"you\": 2, \"is\": 2, \"anyone\": 1, \"there\": 1, \"bye\": 1, \"see\": 1, \"later\": 1, \"goodbye\": 1, \"connect\": 2, \"my\": 40, \"wallet\": 4, \"link\": 2, \"coinbase\": 1, \"check\": 1, \"balance\": 4, \"what\": 2, \"show\": 13, \"predict\": 2, \"transactions\": 7, \"will\": 1, \"look\": 1, \"like\": 1, \"forecast\": 5, \"future\": 1, \"display\": 11, \"list\": 11, \"transaction\": 1, \"history\": 11, \"spending\": 4, \"income\": 4, \"savings\": 4, \"investments\": 3, \"investment\": 1, \"debts\": 3, \"debt\": 1, \"net\": 4, \"worth\": 4, \"budget\": 4, \"trends\": 3, \"trend\": 1, \"summary\": 4, \"all\": 1}", "word_docs": "{\"hi\": 1, \"hello\": 1, \"how\": 1, \"are\": 1, \"you\": 2, \"is\": 2, \"anyone\": 1, \"there\": 1, \"bye\": 1, \"later\": 1, \"see\": 1, \"goodbye\": 1, \"my\": 40, \"connect\": 2, \"wallet\": 4, \"link\": 2, \"coinbase\": 1, \"balance\": 4, \"check\": 1, \"what\": 2, \"show\": 13, \"predict\": 2, \"transactions\": 7, \"look\": 1, \"will\": 1, \"like\": 1, \"forecast\": 5, \"future\": 1, \"display\": 11, \"list\": 11, \"transaction\": 1, \"history\": 11, \"spending\": 4, \"income\": 4, \"savings\": 4, \"investments\": 3, \"investment\": 1, \"debts\": 3, \"debt\": 1, \"net\": 4, \"worth\": 4, \"budget\": 4, \"trends\": 3, \"trend\": 1, \"summary\": 4, \"all\": 1}", "index_docs": "{\"26\": 1, \"27\": 1, \"28\": 1, \"29\": 1, \"20\": 2, \"21\": 2, \"30\": 1, \"31\": 1, \"32\": 1, \"34\": 1, \"33\": 1, \"35\": 1, \"1\": 40, \"22\": 2, \"8\": 4, \"23\": 2, \"36\": 1, \"9\": 4, \"37\": 1, \"24\": 2, \"2\": 13, \"25\": 2, \"6\": 7, \"39\": 1, \"38\": 1, \"40\": 1, \"7\": 5, \"41\": 1, \"3\": 11, \"4\": 11, \"42\": 1, \"5\": 11, \"10\": 4, \"11\": 4, \"12\": 4, \"17\": 3, \"43\": 1, \"18\": 3, \"44\": 1, \"13\": 4, \"14\": 4, \"15\": 4, \"19\": 3, \"45\": 1, \"16\": 4, \"46\": 1}", "index_word": "{\"1\": \"my\", \"2\": \"show\", \"3\": \"display\", \"4\": \"list\", \"5\": \"history\", \"6\": \"transactions\", \"7\": \"forecast\", \"8\": \"wallet\", \"9\": \"balance\", \"10\": \"spending\", \"11\": \"income\", \"12\": \"savings\", \"13\": \"net\", \"14\": \"worth\", \"15\": \"budget\", \"16\": \"summary\", \"17\": \"investments\", \"18\": \"debts\", \"19\": \"trends\", \"20\": \"you\", \"21\": \"is\", \"22\": \"connect\", \"23\": \"link\", \"24\": \"what\", \"25\": \"predict\", \"26\": \"hi\", \"27\": \"hello\", \"28\": \"how\", \"29\": \"are\", \"30\": \"anyone\", \"31\": \"there\", \"32\": \"bye\", \"33\": \"see\", \"34\": \"later\", \"35\": \"goodbye\", \"36\": \"coinbase\", \"37\": \"check\", \"38\": \"will\", \"39\": \"look\", \"40\": \"like\", \"41\": \"future\", \"42\": \"transaction\", \"43\": \"investment\", \"44\": \"debt\", \"45\": \"trend\", \"46\": \"all\"}", "word_index": "{\"my\": 1, \"show\": 2, \"display\": 3, \"list\": 4, \"history\": 5, \"transactions\": 6, \"forecast\": 7, \"wallet\": 8, \"balance\": 9, \"spending\": 10, \"income\": 11, \"savings\": 12, \"net\": 13, \"worth\": 14, \"budget\": 15, \"summary\": 16, \"investments\": 17, \"debts\": 18, \"trends\": 19, \"you\": 20, \"is\": 21, \"connect\": 22, \"link\": 23, \"what\": 24, \"predict\": 25, \"hi\": 26, \"hello\": 27, \"how\": 28, \"are\": 29, \"anyone\": 30, \"there\": 31, \"bye\": 32, \"see\": 33, \"later\": 34, \"goodbye\": 35, \"coinbase\": 36, \"check\": 37, \"will\": 38, \"look\": 39, \"like\": 40, \"future\": 41, \"transaction\": 42, \"investment\": 43, \"debt\": 44, \"trend\": 45, \"all\": 46}"}}